In [27]:
import numpy as np
import pandas as pd

In [32]:
data2 = pd.DataFrame(np.random.randint(5, size=(6, 4)), columns=list('ABCD'))
data2

   A  B  C  D
0  3  4  3  3
1  4  1  1  1
2  0  3  4  0
3  1  4  4  1
4  3  1  0  4
5  1  4  2  2

In [33]:
dates = pd.date_range('20170301', periods=6)
data2.index = dates
data2

            A  B  C  D
2017-03-01  3  4  3  3
2017-03-02  4  1  1  1
2017-03-03  0  3  4  0
2017-03-04  1  4  4  1
2017-03-05  3  1  0  4
2017-03-06  1  4  2  2

In [34]:
data2.sort_values(by='D', ascending=False)

            A  B  C  D
2017-03-05  3  1  0  4
2017-03-01  3  4  3  3
2017-03-06  1  4  2  2
2017-03-02  4  1  1  1
2017-03-04  1  4  4  1
2017-03-03  0  3  4  0

In [35]:
data2.iat[3,3]

1

In [36]:
data2[['A', 'C']][(data2.B>0)&(data2.D>0)]

            A  C
2017-03-01  3  3
2017-03-02  4  1
2017-03-04  1  4
2017-03-05  3  0
2017-03-06  1  2

In [37]:
goal_list = [0.1, 0.2, 0.3]
data2.D.isin(goal_list)

2017-03-01    False
2017-03-02    False
2017-03-03    False
2017-03-04    False
2017-03-05    False
2017-03-06    False
Freq: D, Name: D, dtype: bool

In [38]:
data2.insert(1, 'a', np.random.randn(6))
data2

            A         a  B  C  D
2017-03-01  3 -0.055573  4  3  3
2017-03-02  4  0.077471  1  1  1
2017-03-03  0  0.893725  3  4  0
2017-03-04  1 -0.019566  4  4  1
2017-03-05  3  0.082899  1  0  4
2017-03-06  1  1.465288  4  2  2

In [39]:
df = data2.drop(['a'], axis=1)
df

            A  B  C  D
2017-03-01  3  4  3  3
2017-03-02  4  1  1  1
2017-03-03  0  3  4  0
2017-03-04  1  4  4  1
2017-03-05  3  1  0  4
2017-03-06  1  4  2  2

In [40]:
df2 = df[df['A'] > 0.5]
df2

            A  B  C  D
2017-03-01  3  4  3  3
2017-03-02  4  1  1  1
2017-03-04  1  4  4  1
2017-03-05  3  1  0  4
2017-03-06  1  4  2  2

In [41]:
df2.A.value_counts()

3    2
1    2
4    1
Name: A, dtype: int64

In [42]:
df2.A.sum()

12

In [46]:
group_id = df2.groupby('A')
group_id.first().head(2)

   B  C  D
A
1  4  4  1
3  4  3  3

In [50]:
df2.groupby(['A', 'B'])

In [47]:
group_id = df2.groupby(['A', 'B'])
group_id.first()

     C  D
A B
1 4  4  1
3 1  0  4
  4  3  3
4 1  1  1

In [49]:
group_id.size()

A  B
1  4    2
3  1    1
   4    1
4  1    1
dtype: int64

In [51]:
group_id.agg([np.sum, np.mean, np.std])

      C                  D
    sum mean       std sum mean       std
A B
1 4   6    3  1.414214   3  1.5  0.707107
3 1   0    0       NaN   4  4.0       NaN
  4   3    3       NaN   3  3.0       NaN
4 1   1    1       NaN   1  1.0       NaN